{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "batch_input_shape": [null, 2], "units": 4, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 4, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "linear"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}], "keras_version": "2.0.2"}