{"backend": "tensorflow", "keras_version": "2.0.5", "config": [{"config": {"dtype": "int32", "embeddings_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "input_dim": 56000, "batch_input_shape": [null, null], "output_dim": 128, "name": "embedding_1", "input_length": null, "trainable": true}, "class_name": "Embedding"}, {"config": {"implementation": 0, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.2, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_regularizer": null, "dropout": 0.2, "activation": "tanh", "return_state": false, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "stateful": false, "recurrent_regularizer": null, "use_bias": true, "unroll": false, "go_backwards": false, "name": "lstm_1", "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 128, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 1, "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential"}